<template>
    <div class="modal">
        <div class="modal-container">
                <svg @click="$emit('close')" width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M17.6276 6.31372C17.237 5.92319 16.6039 5.92319 16.2133 6.31372L11.9707 10.5564L7.72806 6.31372C7.33754 5.92319 6.70437 5.92319 6.31385 6.31372C5.92332 6.70424 5.92332 7.33741 6.31385 7.72793L10.5565 11.9706L6.31385 16.2132C5.92332 16.6037 5.92332 17.2369 6.31385 17.6274C6.70437 18.018 7.33754 18.018 7.72806 17.6274L11.9707 13.3848L16.2133 17.6274C16.6039 18.018 17.237 18.018 17.6276 17.6274C18.0181 17.2369 18.0181 16.6037 17.6276 16.2132L13.3849 11.9706L17.6276 7.72793C18.0181 7.33741 18.0181 6.70424 17.6276 6.31372Z" fill="#7E7E7E"/>
                </svg>
            <div class="title">
             Курс жонундо
            </div>
            <div class="title-course">
                {{name}}
            </div>
            <div class="desc">
                {{desc}}
            </div>

            <div class="settings">
                <div class="nav">Профилин коруу</div>
                <div class="nav">
                    <span @click="svz = !svz">Байланышуу</span>
                    <transition name="slide-fade">
                        <ul v-if="svz">
                            <a  :href="t"><li><span class="l1">Telegram аркылуу</span> <svg width="30" height="26" viewBox="0 0 30 26" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M29.2863 0.857178L0.714844 11.0613L8.87811 15.1429L21.123 6.97963L12.9597 17.1837L25.2046 25.347L29.2863 0.857178Z" stroke="#21A95D" stroke-linejoin="round"/>
</svg>
</li>
</a>
                           <a :href="`tel:${p}`">  <li>
                                <span class="l2">Телефон чалуу</span>
                                <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M14.7368 10.5347C13.7499 10.5347 12.7832 10.3806 11.8669 10.0783C11.4198 9.92421 10.912 10.0429 10.6181 10.3427L8.80169 11.7145C6.71748 10.6021 5.38358 9.26906 4.28633 7.20001L5.62106 5.42653C5.95706 5.09053 6.07749 4.59873 5.93349 4.13811C5.62864 3.216 5.4737 2.24842 5.4737 1.26316C5.4737 0.566724 4.90698 0 4.21054 0H1.26316C0.566724 0 0 0.566724 0 1.26316C0 9.38863 6.61137 16 14.7368 16C15.4333 16 16 15.4333 16 14.7368V11.7979C16 11.1015 15.4333 10.5347 14.7368 10.5347Z" fill="#8259E0"/>
</svg>

                            </li>
                           </a>
                            <a :href="y"> 
                             <li><span class="l3">Youtube аркылуу</span>
                             <svg width="20" height="15" viewBox="0 0 20 15" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M19.5825 2.31359C19.4663 1.86788 19.2449 1.46191 18.9396 1.13499C18.6344 0.808079 18.2556 0.571296 17.8401 0.447572C16.2802 2.13969e-05 10.0095 2.1505e-05 10.0095 2.1505e-05C10.0095 2.1505e-05 3.75073 -0.0107145 2.17462 0.447572C1.75974 0.571839 1.38175 0.808871 1.07717 1.13576C0.772597 1.46264 0.551744 1.86832 0.435958 2.31359C0.139742 4.02745 -0.00614963 5.76733 0.00019855 7.51041C-0.00269177 9.24511 0.143176 10.9764 0.435958 12.6824C0.552118 13.1279 0.773037 13.5339 1.07751 13.8614C1.38197 14.1888 1.75977 14.4268 2.17462 14.5525C3.73447 15 10.0095 15 10.0095 15C10.0095 15 16.2646 15 17.8401 14.5525C18.2556 14.4274 18.6341 14.1896 18.9393 13.8621C19.2444 13.5346 19.4659 13.1284 19.5825 12.6824C19.8694 10.9774 20.0095 9.24358 19.9995 7.51041C20.0095 5.76584 19.8726 4.02932 19.5825 2.31359ZM8.00642 10.7224V4.28429L13.2261 7.51041L8.00642 10.7224Z" fill="#4097E3"/>
</svg>
</li>
                            </a>
                           <a :href="i">   <li>
                                <span class="l4">Instagram аркылуу</span>
                                <svg width="15" height="15" viewBox="0 0 15 15" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M7.49798 4.99894C6.12083 4.99894 4.99697 6.12282 4.99697 7.5C4.99697 8.87718 6.12083 10.0011 7.49798 10.0011C8.87514 10.0011 9.999 8.87718 9.999 7.5C9.999 6.12282 8.87514 4.99894 7.49798 4.99894ZM14.9992 7.5C14.9992 6.4643 15.0085 5.43798 14.9504 4.40416C14.8922 3.20335 14.6183 2.13763 13.7402 1.25953C12.8603 0.379564 11.7964 0.107505 10.5956 0.049341C9.55996 -0.00882328 8.53366 0.000558085 7.49986 0.000558085C6.46418 0.000558085 5.43788 -0.00882328 4.40408 0.049341C3.20329 0.107505 2.13759 0.38144 1.25951 1.25953C0.379557 2.1395 0.107503 3.20335 0.0493401 4.40416C-0.00882312 5.43986 0.000558074 6.46618 0.000558074 7.5C0.000558074 8.53382 -0.00882312 9.56202 0.0493401 10.5958C0.107503 11.7967 0.381433 12.8624 1.25951 13.7405C2.13946 14.6204 3.20329 14.8925 4.40408 14.9507C5.43976 15.0088 6.46605 14.9994 7.49986 14.9994C8.53554 14.9994 9.56184 15.0088 10.5956 14.9507C11.7964 14.8925 12.8621 14.6186 13.7402 13.7405C14.6202 12.8605 14.8922 11.7967 14.9504 10.5958C15.0104 9.56202 14.9992 8.5357 14.9992 7.5ZM7.49798 11.3482C5.36846 11.3482 3.64983 9.62956 3.64983 7.5C3.64983 5.37044 5.36846 3.65177 7.49798 3.65177C9.62751 3.65177 11.3461 5.37044 11.3461 7.5C11.3461 9.62956 9.62751 11.3482 7.49798 11.3482ZM11.5037 4.3929C11.0065 4.3929 10.605 3.99138 10.605 3.49417C10.605 2.99696 11.0065 2.59544 11.5037 2.59544C12.0009 2.59544 12.4025 2.99696 12.4025 3.49417C12.4026 3.61223 12.3795 3.72917 12.3343 3.83827C12.2892 3.94738 12.223 4.04651 12.1396 4.13C12.0561 4.21348 11.9569 4.27968 11.8478 4.32479C11.7387 4.3699 11.6218 4.39305 11.5037 4.3929Z" fill="#EFBB03"/>
</svg>

                            </li>
                           </a>
                        </ul>
                    </transition>
                    </div>
                <div @click="share" class="nav">Болушуу</div>
            </div>
        </div>
    </div>
</template>

<script>
export default {
    props:['name','desc','t','p','i','y'],
    data:()=>({
        svz:false
    }),
    methods:{
        share(){
            navigator.share({
            title: "Поделится этим курсом",
            url  :location.href
        });
        }
    }
}
</script>

<style lang="scss" scoped>
@import '@/assets/styles/main.scss';
a{
  text-decoration: none;
}
.slide-fade-enter-active {
  transition: all .3s ease;
}
.slide-fade-leave-active {
  transition: all .8s cubic-bezier(1.0, 0.5, 0.8, 1.0);
}
.slide-fade-enter, .slide-fade-leave-to
/* .slide-fade-leave-active до версии 2.1.8 */ {
  transform: translateY(100px);
  opacity: 0;
}

.modal{
    top:0;
    left: 0;
    width: 100%;
    height: 100vh;
    position: fixed;
    z-index: 10;
    background: rgba(0,0,0,0.8);

    display: flex;
    align-items: flex-end;
    justify-content: center;
    &-container{
        width: 100%;
        min-height: 100vh;
        background: #FFFFFF;
        border-radius: 10px;
        position: relative;
        padding: 205px 0px 0 0 ;
        .title{
            text-align: center;
            @include h2{
                color: $bl;
            }
        }
        .desc{
            @include h4;
            text-align: center;
            margin: 30px auto;
            width: 70%;

        }
        .title-course{
            @include h3{
                text-align: center;
                margin: 30px 0;
            }
        }

        .settings{
            display: flex;
            padding: 0 40px;
            margin: 100px 0;
            gap: 20px;
            flex-direction: column;
            .nav{
                @include h3;
            }
            ul{
                margin: 20px 0 0px 40px ;
                width: 70%;
                li{
                    margin: 5px 0;
                    @include h5;
                    list-style: none;
                    display: flex;
                    align-items: center;
                   justify-content: space-between;
                    
                }
              .l1{
                    color: $gr;
                }
               .l2{
                    color: #8259E0;
                }
               .l3{
                    color: #4097E3;
                }
               .l4{
                    color: #EFBB03;
                }
            }
        }
      
        
    & > svg{
        position: absolute;
        top: 24%;
        left: 15px;

    }
    }

}
</style>